<template>
  <div class="term-background">
    <div class="term-content">
      <div class="title">《CCDAO服务条款》</div>
      <div class="content">
        <div class="time">最后更新时间：2023 年 8 月 10 日</div>

        <div class="marginTop">
          <div>尊敬的用户：</div>
          <div>
            感谢您选择CCDAO插件钱包。《CCDAO使用协议》（以下简称“本协议”）由CCDAO FOUNDATION
            LTD.（以下简称“CCDAO”，“公司”或“我们”）和用户（以下简称“您”或“用户”）签订,
            本协议在您与CCDAO之间具有合同上的法律效力。
          </div>
        </div>

        <div class="marginTop">
          <div>
            CCDAO在此提醒您，在使用CCDAO（以下简称“CCDAO”或“应用程序”）之前，您必须仔细阅读本协议全文及本协议中提及的其他文件。
            特别是，您必须仔细阅读“免责声明和责任限制”部分以及其他以粗体显示的部分。
            您必须确保完全理解整个协议并自行评估使用CCDAO的风险。
            此外，CCDAO可以在移动应用平台上下载，包括但不限于Google Play和App Store。
          </div>
        </div>

        <div class="marginTop">
          <div>一、 关于本协议的确认与接纳</div>
          <div>
            1.
            您理解本协议及有关协议适用于CCDAO及CCDAO上本公司所自主开发和拥有的去中心化应用（简称“DApp”）（排除第三方开发的DApp）。
          </div>
          <div>
            2.
            您下载CCDAO插件钱包软件并创建或导入钱包，即视为您已经充分阅读并接受本协议全部条款，本协议立即生效，对双方具有约束力。
          </div>
          <div>
            3.
            本协议可由本公司随时更新，经修改的协议一经在CCDAO上公布，立即自动生效，恕不再另行通知。在本公司公布修改协议条款后，如果您不接受修改后的条款，请立即停止使用CCDAO，您继续使用CCDAO将被视为接受修改后的协议。
          </div>
          <div>4. 如果您未满18周岁，或者是无民事行为能力人或限制民事行为能力人，请在父母或监护人指导下使用CCDAO。</div>
        </div>

        <div class="marginTop">
          <div>二、 定义</div>
          <div>
            1）CCDAO插件钱包：CCDAO基于BTC、ETH、BSC、HECO、TRON、Polkadot、Kusama、EOS、COSMOS、BOS、ENU、MOAC、IOST等CCDAO未来可能支持的区块链系统开发的区块链钱包，以及其他为方便用户使用区块链系统而开发的配套工具。
          </div>
          <div>2）用户：</div>
          <div class="needIndent">A. 用户必须是具备完全民事行为能力的自然人；</div>
          <div class="needIndent">
            B.
            若您为18周岁以下的未成年人使用CCDAO插件钱包服务，需要在您父母或监护人的指导下使用。无民事行为能力人使用CCDAO插件钱包或限制民事行为能力人超过其民事权利或行为能力范围从事交易的，造成的一切后果，CCDAO有权要求您及您的父母或监护人负责。
          </div>
          <div>3）被排出人士：</div>
          <div class="needIndent">A. 除了自然人以外的、具备订立本协议的法律和意识能力的人士；或</div>
          <div class="needIndent">
            B.
            因本协议、法律、监管要求或适用于该用户的司法管辖区的规定而被以任何形式或方式（全部或部分）禁止、限制、无授权或无资格使用服务（如本协议所定义）的用户。为免疑义，中国用户亦涵盖在“被排除人士”的定义内。
          </div>
          <div>4）使用相关：</div>
          <div class="needIndent">A. 创建或导入钱包：指您使用CCDAO插件钱包，确认履行本协议并创建或导入钱包的过程。</div>
          <div class="needIndent">
            B.
            钱包密码：指您在创建CCDAO插件钱包过程中，软件操作界面提示您填写的密码，该密码用于加密保护私钥。作为去中心化的应用，钱包密码不存储在您的这台移动设备或本公司的服务器，一旦丢失你需要借助明文私钥或助记词重置新密码。
            温馨提示：CCDAO插件钱包软件操作界面涉及的信息提示内容，建议用户按照相关步骤进行操作。
          </div>
          <div class="needIndent">
            C. 特定用户：指按照澳大利亚法律法规及政策规定必须要配合本公司履行个人信息披露义务的用户。
          </div>
          <div class="needIndent">D. 私钥：由256位随机字符构成，是用户拥有并使用数字代币的核心。</div>
          <div class="needIndent">
            E. 公钥：由私钥借助密码学原理单向推导生成，并用以生成区块链数字钱包地址，数字钱包地址即为公开收款地址。
          </div>
          <div class="needIndent">
            F. 助记词：符合区块链BIP39
            行业标准，由随机算法生成的12（或15/18/21/24）个有序单词组成。是私钥的易记录表现形式，方便用户备份保管。
          </div>
          <div class="needIndent">
            G. Keystore:
            是私钥或助记词经过用户设置的钱包密码加密保存的文件形式，它只存储在您的这台移动设备中，不会同步至本公司服务器。
          </div>
          <div class="needIndent">H. 数字代币：指CCDAO插件钱包目前支持的数字代币种类，包括但不限于ETH、EOS等。</div>
          <div class="needIndent">
            I. 资料：CCDAO“新闻”等栏目内容。 这些材料是 CCDAO 的专有财产。
            未经CCDAO许可和授权，用户不得复制或传播这些材料。
          </div>
          <div class="needIndent">
            J.
            个人信息：指以电子或者其他方式记录的能够单独或者与其他信息结合识别用户个人身份的各种信息，包括但不限于自然人的姓名、出生日期、身份证件号码、个人生物识别信息、住址、电话号码、银行卡号、邮件地址、钱包地址、移动设备信息、操作记录、交易记录等，但不包括用户的钱包密码、私钥、助记词、Keystore，对于国家法律规定的非我公司必要收集信息的，我公司将在征得个人同意后方进行收集，并保证严格对于收集到的个人信息予以严格保密，未经个人本人同意，不得向其他第三方泄露。
          </div>
          <div class="needIndent">K. 中国：指中华人民共和国，包括香港特别行政区、澳门特别行政区、台湾地区。</div>
          <div class="needIndent">
            L.
            第三方服务：指第三方DApp、第三方DeFi、第三方智能合约、第三方开源协议、第三方网页、第三方硬件钱包、第三方在线网页钱包、第三方交易所等第三方提供的产品和服务。
          </div>
        </div>

        <div class="marginTop">
          <div>三、 服务内容</div>
          <div>
            1.
            创建或导入钱包。对CCDAO插件钱包支持的数字代币，您可以使用CCDAO插件钱包生成新钱包或导入相关区块链系统的其它钱包工具生成的兼容钱包。
          </div>
          <div>
            2.
            转账、收款。您可以使用CCDAO插件钱包的转账、收款功能进行数字代币的管理，即运用私钥进行电子签名，对相关区块链的账本进行修改。转账是指付款方利用收款方的区块链地址进行转账操作，实际的转账、收款行为均在相关区块链系统（而非CCDAO插件钱包）发生。
          </div>
          <div>
            3.
            行情查看。您可以使用CCDAO插件钱包查看所提供的数字代币汇率价格。CCDAO插件钱包通过抓取相应的数字代币汇率信息并展示在CCDAO插件钱包中的相应版块。
          </div>
          <div>4. 管理数字资产。您可以使用CCDAO插件钱包添加、保管并移除CCDAO插件钱包所支持的数字代币。</div>
          <div>
            5.
            浏览DApp。用户通过在CCDAO插件钱包上的链接，可以跳转至DApp并使用该DApp（包括本公司自己的DApp和第三方DApp）提供的服务。
          </div>
          <div>6. 交易记录。我们将通过区块链系统拷贝您全部或部分的交易记录。但交易记录以区块链系统的记载为准。</div>
          <div>
            7.
            暂停服务。您知悉基于区块链系统交易“不可撤销”的属性，我们不能为您暂停或撤销转账交易等操作，但在一定情况下，我们可以暂停或者限制某位用户对CCDAO插件钱包软件的操作。
          </div>
          <div>
            8.
            注册CCDAO（EOS系统下有效的去中心化解决方案）所需的手机号码、电子邮箱地址以及添加的Owner权限均归CCDAO所有。
            注册开始时，我们会向您发出特别说明。
            如果您选择使用该功能，则视为您已同意并认可所有条款。在使用CCDAO手机号码和电子邮件地址（EOS系统下有效的去中心化解决方案）注册时，您的手机或电子邮件地址将
            可以作为优惠券收集。
            默认添加Owner的多重签名权限，方便私钥找回。在使用手机和邮箱的注册方式（EOS系统下有效的去中心化解决方案）中，我们将强制多重签名
            设置为CCDAO Owner权限，最大程度保障用户权限安全。 另外，区块信息是可追溯的，从而实现了最大的公开性和透明度。
            可以查看账户每项操作的发起人。
          </div>
          <div>
            9.
            币币兑换。用户可以与使用第三方智能合约或第三方DEX进行数字代币兑换，由CCDAO插件钱包作为界面工具帮助用户和第三方交互并显示该数字代币兑换的相应结果。
          </div>
          <div>10. 其他本公司认为有必要提供的服务。</div>
        </div>

        <div class="marginTop">
          <div>四、 用户接受本公司提供的上述服务时应了解以下常见问题</div>
          <div>
            1.秉承着区块链的去中心化特点，并为了保护用户的数字代币安全，本公司提供去中心化服务，大大区别于银行业金融机构。用户了解本公司（去中心化方案）不提供以下服务：
          </div>
          <div class="needIndent">
            A. 存储用户的钱包密码（即用户创建/导入钱包时设置的密码）、私钥、助记词、Keystore；
          </div>
          <div class="needIndent">B. 找回用户的钱包密码、私钥、助记词、Keystore；</div>
          <div class="needIndent">C. 冻结钱包；</div>
          <div class="needIndent">D. 挂失钱包；</div>
          <div class="needIndent">E. 恢复钱包；</div>
          <div class="needIndent">F. 交易回滚。</div>
          <div>
            2.由于本公司不提供上述服务，因此用户应当自行保管含有CCDAO插件钱包的移动设备、备份CCDAO插件钱包、备份钱包密码、助记词、私钥及Keystore。如用户遗失移动设备、删除且未备份CCDAO插件钱包、删除且未备份钱包、钱包被盗或遗忘钱包密码、私钥、助记词、Keystore，本公司均无法还原钱包或找回钱包密码、私钥、助记词、Keystore；如用户进行交易时误操作（例如输错转账地址），本公司亦无法取消交易。
          </div>
          <div>
            3.本公司和CCDAO插件钱包所能够提供的数字代币管理服务并未包括所有已存在的数字代币，请勿通过CCDAO插件钱包操作任何CCDAO插件钱包不支持的数字代币。
          </div>
          <div>
            4.CCDAO插件钱包仅是用户的数字代币管理工具，并非交易所或交易平台。虽然本协议将多次提及“交易”，其行为泛指用户使用。CCDAO插件钱包进行的转账和收款操作，这与交易所或交易平台上进行的“交易”有本质区别。
          </div>
          <div>
            5.CCDAO插件钱包上集成的DApp包括本公司自主拥有的DApp和第三方平台提供的DApp。对于第三方平台提供的DApp，CCDAO插件钱包仅为用户进入DApp提供区块链浏览器。用户在第三方DApp上接受服务或进行交易前应自行判断和评估该第三方DApp提供的服务或交易是否存在风险。
          </div>
        </div>

        <div class="marginTop">
          <div>五、 您的权利义务</div>
          <div>1. 创建或导入钱包</div>
          <div class="needIndent">
            A.
            创建或导入钱包：您有权在您的电子设备上通过CCDAO插件钱包创建和/或导入钱包，有权设定钱包的钱包密码等信息，并有权通过CCDAO插件钱包应用程序，使用自己的钱包在区块链上进行转账和收款等交易。
          </div>
          <div class="needIndent">
            B.
            身份验证：按照有关法律法规和政策要求，特定用户在使用CCDAO插件钱包提供的有关服务时，应当按照CCDAO插件钱包的提示及时完成相关身份验证，要求您提交包括但不限于您的姓名、身份证号码、手机号码、银行卡号信息等个人信息。否则该特定用户将无法使用有关服务，因特定用户拖延造成的损失由您自行承担。
          </div>
          <div class="needIndent">
            C.
            本公司可能为不同的终端设备开发不同的软件版本，您应当根据实际需要选择下载合适的版本进行安装。如果您从未经合法授权的第三方获取本软件或与本软件名称相同的安装程序，本公司将无法保证该软件能否正常使用，也无法保证其安全性，因此造成的损失由您自行承担。
          </div>
          <div class="needIndent">
            D.
            本软件新版本发布后，旧版软件可能无法使用。本公司不保证旧版软件的安全性、继续可用性及提供相应的客户服务。请您随时核对并下载最新版本。
          </div>
          <div>2. 使用：</div>
          <div class="needIndent">
            A.
            用户应自行妥善保管移动设备、钱包密码、私钥、助记词、Keystore等信息。本公司不负责为用户保管以上信息。因您遗失移动设备、主动或被动泄露、遗忘钱包密码、私钥、助记词、Keystore或遭受他人攻击、诈骗等所引起的一切风险、责任、损失、费用应由您自行承担。
          </div>
          <div class="needIndent">
            B.
            遵循信息提示。您了解并同意遵循CCDAO插件钱包对您做出的信息提示，按照信息提示的内容进行操作，否则，由此引起的一切风险、责任、损失、费用等应由您自行承担。
          </div>
          <div class="needIndent">
            C.
            您知悉并理解CCDAO插件钱包没有义务对链接的第三方DApp服务或交易履行尽职调查义务，您应当理性做出投资决策并自主承担相应的投资风险。
          </div>
          <div class="needIndent">
            D.
            积极完成身份验证。当CCDAO插件钱包合理认为您的交易行为或交易情况出现异常的，或认为您的身份信息存在疑点的，或CCDAO插件钱包认为应核对您身份证件或其他必要文件的情形时，请您积极配合CCDAO核对您的有效身份证件或其他必要文件，及时完成相关的身份验证。
          </div>
          <div class="needIndent">
            E.
            使用CCDAO插件钱包手机号码、邮箱注册方式（EOS体系有效去中心解决方案），您可以选择导出私钥功能来获得私钥以更好的管理您的账户，您也知悉您可以将默认添加的多签owner权限进行删除，并且了解并明白删除默认添加的多签owner权限，本公司将无法帮助您进行私钥恢复。
          </div>
          <div>3. 转账：</div>
          <div class="needIndent">
            A.
            您知悉对于CCDAO插件钱包服务中您可使用的日计转账限额和笔数，可能因为您使用该转账服务时所处的国家/地区、监管要求、转账目的、CCDAO风险控制、身份验证等事由而不同。
          </div>
          <div class="needIndent">
            B.
            您理解基于区块链操作的“不可撤销”属性，当您使用CCDAO插件钱包转账功能时，您应当自行承担因您操作失误而导致的后果（包括但不限于因您输错转账地址、您自身选择转账节点服务器的问题）。
          </div>
          <div class="needIndent">
            C. 您知悉在使用CCDAO插件钱包服务时，以下情况的出现可能导致转账“交易失败”或“打包超时”：
          </div>
          <div class="needIndent2">a) 钱包余额不足；</div>
          <div class="needIndent2">b) 交易矿工费不足；</div>
          <div class="needIndent2">c) 区块链执行合约代码失败；</div>
          <div class="needIndent2">d) 超出监管部门、CCDAO插件钱包或法律法规规定的付款额度；</div>
          <div class="needIndent2">e) 网络、设备等技术故障；</div>
          <div class="needIndent2">f) 区块链网络拥堵、故障等原因引起交易被抛弃；</div>
          <div class="needIndent2">
            g) 您的地址或交易对方地址被识别为特殊地址, 如高风险地址、交易所地址、ICO 地址、Token地址等。
          </div>
          <div class="needIndent">
            D.
            您知悉CCDAO插件钱包仅向您提供转账工具，在您使用CCDAO插件钱包完成转账后，本公司即完成了当次服务的所有义务，本公司对其他纠纷争议，不负担任何义务。
          </div>
          <div class="needIndent">
            E.
            合法合规。您知悉在CCDAO插件钱包进行操作时或利用CCDAO插件钱包上的DApp进行交易时，您应当遵循有关法律法规、国家政策的要求。
          </div>
          <div class="needIndent">
            F.
            公告通知。CCDAO插件钱包会以网站公告、电子邮件、发送短信、电话、消息中心信息、弹窗提示或客户端通知等方式向您发送通知，例如通知您交易进展情况，或者提示您进行相关操作，请您及时予以关注。
          </div>
          <div>4.服务费用与纳税义务：</div>
          <div class="needIndent">
            A. CCDAO插件钱包暂时不向您收取任何形式的服务费或手续费，将来需对某些服务进行收费时将另行约定或公布规则；
          </div>
          <div class="needIndent">
            B. 您使用CCDAO插件钱包进行转账时应支付矿工费，金额由您自行决定。矿工费由相关区块链系统收取；
          </div>
          <div class="needIndent">
            C.
            您知悉在特定情况下，因为您所处的环境及网络状态不稳定，导致您的转账操作未完成时，亦会被相关区块链系统收取矿工费；
          </div>
          <div class="needIndent">
            D. 您因在CCDAO插件钱包进行交易而发生的所有应纳税负及其它方面的费用均由您负责支付。
          </div>
        </div>

        <div class="marginTop">
          <div>六、 风险提示</div>
          <div>
            1.
            您了解并知悉，由于数字代币领域的法律法规政策尚未健全，该领域的数字代币可能会产生无法兑现、技术不稳定等重大风险。且数字代币的价格波动幅度远高于其他金融资产。我们谨慎提醒您应当根据自身财务状况和风险偏好，理性选择持有或处置任何一种数字代币。CCDAO插件钱包提供的行情查看功能仅系抓取部分交易所的数字代币汇率信息的搜索结果，并不表示为最新行情或最佳报价。
          </div>
          <div>
            2.
            在使用CCDAO插件钱包服务时，若您或您的相对方未遵从本协议或相关网站说明、交易、支付页面中之操作提示、规则，CCDAO插件钱包并不保证交易会顺利完成，且CCDAO插件钱包不承担损害赔偿责任。若发生前述情形，而款项已先行入账您的或您的交易方账号中。
          </div>
          <div>
            3.
            CCDAO插件钱包或第三方钱包，您理解区块链操作具有的“不可逆”属性，以及相关交易具有“不可撤销”的特征，由您及您的相对方自行承担相应的风险后果。
          </div>
          <div>
            4.
            在您使用CCDAO插件钱包集成的第三方DApp服务或进行交易时，为了您的利益，本公司建议您仔细阅读本协议及CCDAO插件钱包提示，了解交易对象及产品信息，谨慎评估风险后再采取行动。所有您在第三方DApp进行的交易行为系您的个人行为，有约束力的合同关系在您和您的相对方之间建立，与CCDAO无关。CCDAO插件钱包对因您的交易行为所引起的一切风险、责任、损失、费用不承担任何责任。
          </div>
          <div>
            5. 您理解该等交易及相应的合同关系是您与您的交易对方之间的。 CCDAO
            对因该等交易而产生的任何风险、责任、损失或费用不承担任何责任。
          </div>
          <div>
            6.
            您在交易过程中应当自行判断对方是否为完全民事行为能力人并自行决定是否与对方进行交易或转账给对方等，且您自行承担与此相关的所有风险。
          </div>
          <div>
            7.
            在转账过程中，如果出现“交易失败”、“打包超时”等类似的异常信息提示时，您应通过相关区块链系统的官方途径或其他的区块链查询工具进行再次确认，以避免重复转账；否则，由此所引起的一切损失和费用应由您自行承担。
          </div>
          <div>
            8.
            您理解当您在CCDAO插件钱包上创建或导入钱包之后，您的Keystore、私钥、助记词等信息仅存储在当前的这台移动设备中，不存储在CCDAO插件钱包或本公司的服务器上。您可以按照CCDAO插件钱包提供的操作指南采取同步钱包等方式更换移动设备。但若您未保存或备份钱包密码、私钥、助记词、Keystore等信息且在您移动设备丢失的情况下，您的数字代币将因此丢失，本公司无法为您找回，您需自行承担相应损失。若您在导出、保存或备份钱包密码、私钥、助记词、Keystore等信息的时候泄密，或保存或备份上述信息的设备或服务器被黑客攻击或控制等情况下，您的数字代币将因此丢失，本公司无法为您找回，您需自行承担相应损失。
          </div>
          <div>
            9.
            我们建议您在创建或导入钱包时对您钱包的钱包密码、私钥、助记词及Keystore等信息做好安全备份。我们提请您注意，请不要采用以下备份方式：截图、邮件、记事本、短信、微信、QQ等电子备份方式。我们建议您在纸质记事本上抄写助记词和Keystore等信息，同时您亦可将电子数据保管至密码管理器。
          </div>
          <div>
            10. 为了避免潜在的安全风险，我们建议您在安全的网络环境中使用CCDAO。 请不要使用越狱或 Root 的移动设备。
          </div>
          <div>
            11.
            您在使用我们的服务过程中，警惕非CCDAO插件钱包官方的诈骗行为。一旦发现此类行为，我们鼓励您第一时间告知我们。
          </div>
        </div>

        <div class="marginTop">
          <div>七、 服务的变更、中断、终止</div>
          <div>
            1.
            您同意本公司为保证自主业务经营权可以暂时提供部分服务功能，或于将来暂停部分服务功能或开通新的服务功能。当任何功能减少或者增加或者变化时，只要您仍然使用本公司提供的服务，表示您仍然同意本协议或者本协议修正后的条款。
          </div>
          <div>2. 您理解存在如下情形时，本公司将暂停提供服务：</div>
          <div class="needIndent">A. 因设备、区块链系统维修、升级、故障和通信中断等技术原因而中断业务；</div>
          <div class="needIndent">
            B.
            因台风、地震、海啸、洪水、停电、战争或恐怖袭击等不可抗力因素，病毒、木马、黑客攻击、系统不稳定或政府行为等原因，造成本公司系统不能提供服务或本公司合理认为继续提供服务会有较大风险的；
          </div>
          <div class="needIndent">C. 发生本公司无法控制或合理预见的其他情形。</div>
          <div class="needIndent">
            D. 当您出现如下情况时，本公司可单方面中止或终止您使用CCDAO插件钱包的部分或全部功能:
          </div>
          <div class="needIndent2">（1）用户死亡；</div>
          <div class="needIndent2">（2）盗用他人的钱包信息或移动设备；</div>
          <div class="needIndent2">（3）填写个人信息时提供虚假信息；</div>
          <div class="needIndent2">（4）拒绝本公司为提升CCDAO插件钱包功能而发起的强制更新操作；</div>
          <div class="needIndent2">（5）将CCDAO插件钱包用于违法或犯罪活动；</div>
          <div class="needIndent2">（6）妨碍其他用户正常使用；</div>
          <div class="needIndent2">（7）伪称本公司的工作人员或管理人员；</div>
          <div class="needIndent2">（8）攻击、侵入、更改或以任何其他方式威胁本公司计算机系统的正常运作；</div>
          <div class="needIndent2">（9）利用CCDAO插件钱包宣传垃圾广告；</div>
          <div class="needIndent2">（10）散布谣言，损害本公司和CCDAO插件钱包商誉；</div>
          <div class="needIndent2">（11）违法行为，其他违反本协议的行为，及本公司合理认为应当暂停功能的情形。</div>
          <div>3. 当您与本公司之间的服务关系变更、中断、终止时，您仍有权在合理时间内导出您钱包等信息。</div>
        </div>

        <div class="marginTop">
          <div>八、 您合法使用本公司服务的承诺</div>
          <div>
            1. 您应遵守您所居住的国家或地区的法律法规，不得将CCDAO用于任何非法目的，也不得以任何非法方式使用本公司服务。
          </div>
          <div>2. 您不得利用CCDAO插件钱包从事违法或犯罪的行为，包括但不限于：</div>
          <div class="needIndent">
            A. 反对宪法所确定的基本原则，危害国家安全、泄漏国家秘密、颠覆国家政权、破坏国家统一的；
          </div>
          <div class="needIndent">B. 从事任何违法犯罪行为，包括但不限于洗钱、非法集资等；</div>
          <div class="needIndent">
            C.
            通过使用任何自动化程序、软件、引擎、网络爬虫、网页分析工具、数据挖掘工具或类似工具，接入本公司服务、收集或处理本公司所提供的内容，干预或试图干预任何用户或任何其他方式接入本公司服务的行为；
          </div>
          <div class="needIndent">D. 提供赌博资讯或以任何方式引诱他人参与赌博；</div>
          <div class="needIndent">E. 侵入他人CCDAO插件钱包钱包盗取数字代币；</div>
          <div class="needIndent">F. 进行与交易对方宣称的交易内容不符的交易，或不真实的交易；</div>
          <div class="needIndent">G. 从事任何侵害或可能侵害CCDAO插件钱包服务系统、数据之行为；</div>
          <div class="needIndent">H. 其他违法以及本公司有正当理由认为不适当的行为。</div>
          <div>
            3.
            您理解并同意，如因您违反有关法律（包括但不限于海关及税务方面的监管规定）或者本协议之规定，使本公司遭受任何损失、受到任何第三方的索赔或任何行政管理部门的处罚，您应对本公司进行赔偿，包括合理的律师费用。
          </div>
          <div>4. 您不属于资格使用CCDAO插件钱包服务的被排除人士。</div>
          <div>5. 您承诺按时缴纳本公司的服务费用（如有），否则本公司有权暂停或中止对您提供的服务。</div>
        </div>

        <div class="marginTop">
          <div>九、 隐私条款</div>
          <div>本公司十分重视对用户隐私的保护，相关隐私保护政策请参考本公司公布并不时更新的《CCDAO隐私政策》。</div>
        </div>

        <div class="marginTop">
          <div>十、 免责及责任限制</div>
          <div>1. 本公司仅对本协议中所列明的义务承担责任。</div>
          <div>
            2.
            您理解和同意，在法律所允许的范围内，本公司只能按照现有的技术水平和条件提供CCDAO插件钱包服务。因下列原因导致CCDAO插件钱包无法正常提供服务，本公司不承担责任：
          </div>
          <div class="needIndent">A. CCDAO插件钱包系统停机维护或升级；</div>
          <div class="needIndent">B. 因台风、地震、洪水、雷电或恐怖袭击等不可抗力原因；</div>
          <div class="needIndent">C. 您的移动设备软硬件和通信线路、供电线路出现故障的；</div>
          <div class="needIndent">D. 您操作不当或未通过本公司授权或认可的方式使用本公司服务的；</div>
          <div class="needIndent">
            E.
            因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、电力故障、银行等原因或政府行为等原因；
          </div>
          <div class="needIndent">F. 非因本公司的原因而引起的任何其它原因。</div>
          <div>3.本公司对以下情形不承担责任：</div>
          <div class="needIndent">
            A.
            因用户遗失移动设备、删除且未备份CCDAO插件钱包、删除且未备份钱包、钱包被盗或遗忘钱包密码、私钥、助记词、Keystore而导致的数字代币丢失。
          </div>
          <div class="needIndent">
            B.
            因用户自行泄露钱包密码、私钥、助记词、Keystore，或借用、转让或授权他人使用自己的移动设备或CCDAO插件钱包钱包，或未通过本公司官方渠道下载CCDAO插件钱包应用程序或其他不安全的方式使用CCDAO插件钱包应用程序导致的数字代币丢失；
          </div>
          <div class="needIndent">
            C. 因用户误操作（包括但不限于您输错转账地址、您自身选择转账节点服务器的问题）导致的数字代币丢失；
          </div>
          <div class="needIndent">D. 因用户不理解区块链技术的性质而进行误操作导致的数字代币丢失；</div>
          <div class="needIndent">
            E. 因时间滞后、区块链系统不稳定等原因导致本公司拷贝用户在区块链上的交易记录发生偏差；
          </div>
          <div>
            4. 在使用CCDAO手机号和邮箱地址注册方式下（EOS系统下有效的去中心化解决方案），用户可以选择导出私钥。
            用户变更Owner和Active权限后因私钥丢失或被盗而造成的财产损失，CCDAO不以任何方式承担责任。
          </div>
          <div>
            5.
            在CCDAO手机号+邮箱注册方式默认模式下（EOS系统下有效的去中心化解决方案），如果由于用户原因（如用户无法通过手机号找回私钥）
            获取新的SIM卡），CCDAO将不提供私钥找回服务。
          </div>
          <div>
            6.
            由于用户个人原因（包括但不限于手机号码、邮箱丢失，验证码泄露，个人公开私钥，用户个人信息被黑客入侵）及不可抗拒因素导致的资产丢失，均与本公司无关。
          </div>
          <div>
            7.
            用户在第三方DApp上操作产生的风险和后果。您理解CCDAO仅作为您数字代币管理的工具。本公司不能控制第三方DApp提供的产品及服务的质量、安全或合法性，信息的真实性或准确性，以及相对方履行其在与您签订的协议项下的各项义务的能力。所有您在第三方DApp进行的交易行为系您的个人行为，有约束力的合同关系在您和您的相对方之间建立，与CCDAO无关。本公司提醒您应该通过自己的谨慎判断确定登录DApp及相关信息的真实性、合法性和有效性。您与任何第三方交易所产生的风险亦应由您自行承担。
          </div>
          <div class="marginTop">
            本公司可能同时为您及您的交易对手方提供服务，您同意对本公司可能存在的该等行为予以明确豁免任何实际或潜在的利益冲突，并不得以此来主张本公司在提供服务时存在法律上的瑕疵，也不因此而加重本公司的责任或注意义务。
          </div>
        </div>

        <div class="marginTop">
          <div>十一、 本公司不提供以下形式的保证：</div>
          <div>1. 本公司服务将符合您的全部需求；</div>
          <div>2. 您经由本公司服务取得的任何技术、产品、服务、资讯将符合您的期望；</div>
          <div>3. 本公司从第三方交易所抓取的数字代币市场交易行情等信息的及时性、准确性、完整性、可靠性做出保证；</div>
          <div>4. 您在CCDAO上的交易各方会及时履行其在与您达成的交易协议中各项义务。</div>
          <div>5. 在任何情况下，本公司对本协议所承担的违约赔偿责任总额不超过</div>
          <div class="needIndent">A. 0.1个以太币；或</div>
          <div class="needIndent">B. 100 AUD，以较高的为准。</div>
          <div>
            6.
            您理解CCDAO仅作为用户管理数字代币、显示交易信息的工具，本公司不提供法律、税务或投资建议等服务。您应当自行向法律、税务、投资方面的专业人士寻求建议，且您在使用我们服务过程中所遭受的投资损失、数据损失等，本公司概不负责。
          </div>
          <div>
            7.
            您理解根据有关政策法规的要求，我们可能不时更改我们的用户准入标准，限定向某一特定群体提供服务的范围和方式等。
          </div>
        </div>

        <div class="marginTop">
          <div>十二、 完整协议</div>
          <div>1. 本协议由《CCDAO使用协议》、《CCDAO隐私政策》及本公司不时公布的各项规则组成。</div>
          <div>2. 本协议部分内容被有管辖权的法院认定为违反或无效的，不因此影响其他内容的效力。</div>
          <div>
            3.
            本协议的任何译文版本仅为方便用户而提供，无意对本协议的条款进行修改。如果本协议的中文版本与非中文版本之间存在冲突，应以中文版本为准。
          </div>
        </div>

        <div class="marginTop">
          <div>十三、 知识产权保护</div>
          <div>
            CCDAO是本公司开发并拥有知识产权的应用程序。
            CCDAO中显示的任何内容（包括本协议、公告、文章、视频、音频、图片、档案、资讯、资料、商标或标识）的知识产权归本公司或第三方权利人所有。用户仅可为持有和管理数字代币之目的使用CCDAO应用程序及其中的内容。未经本公司或第三方权利人的事先书面同意，任何人不得擅自使用、修改、反向编译、复制、公开传播、改变、散布、发行或公开发表上述应用程序及内容。
          </div>
        </div>

        <div class="marginTop">
          <div>十四、 法律适用与争议解决</div>
          <div>
            1.
            本协议及其修订版之效力、解释、变更、执行与争议解决均适用本公司共和国法律，如无相关法律规定，则应当适用国际商业惯例和（或）行业惯例。
          </div>
          <div>
            2.
            若您和本公司之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，任何一方可提交本公司所在地有管辖权的人民法院管辖。
          </div>
        </div>

        <div class="marginTop">
          <div>十五、 其他</div>
          <div>
            1. 如您是澳大利亚以外用户，您需全面了解并遵守您所在司法辖区与使用本公司服务所有相关法律、法规及规则。
          </div>
          <div>2. 您在使用本公司服务过程中，如遇到任何问题，您可以通过在CCDAO提交反馈等方式联系我们。</div>
          <div>
            3.
            您可以在CCDAO中查看本协议。本公司鼓励您在每次访问CCDAO时都查阅本公司使用协议。本协议将于2023年8月10日生效。
          </div>
        </div>

        <div class="marginTop">
          <div>本政策未尽事宜，您需遵守我们不时更新的公告及相关规则。</div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "termsOfServiceZh",
};
</script>

<style></style>
